In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

from pydataset import data
import matplotlib.pyplot as plt
import scipy.stats as stats

import env as env
import acquire as acq
import prepare as prp

# 1. Attendance Data

In [8]:
query=("select * from attendance;")
url = env.get_db_url('tidy_data')
attendance = pd.read_sql(query,url)

In [ ]:
sales_df.columns = ['product', '2016', '2017', '2018']
sales_df = sales_df.melt(id_vars=['product'], var_name='year', value_name='sales')

In [10]:
attendance.head(2)

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T

In [18]:
attendance = attendance.rename(columns={"Unnamed: 0": "name"})

In [19]:
attendance.head(1)

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T

In [24]:
attendance_melted = attendance.melt(id_vars=['name'], var_name='day', value_name='type')

In [ ]:
# One half day is worth 50% of a full day, 
# and 10 tardies is equal to one absence.

In [25]:
attendance_melted.head(15)

     name         day type
0   Sally  2018-01-01    P
1    Jane  2018-01-01    A
2   Billy  2018-01-01    A
3    John  2018-01-01    P
4   Sally  2018-01-02    T
5    Jane  2018-01-02    P
6   Billy  2018-01-02    T
7    John  2018-01-02    T
8   Sally  2018-01-03    T
9    Jane  2018-01-03    T
10  Billy  2018-01-03    A
11   John  2018-01-03    H
12  Sally  2018-01-04    H
13   Jane  2018-01-04    T
14  Billy  2018-01-04    A

In [34]:
attendance_melted[(attendance_melted['name'] == 'Sally')&(attendance_melted['type'] == 'P')]

     name         day type
0   Sally  2018-01-01    P
16  Sally  2018-01-05    P

In [99]:
def condition(row):
    if row=='P':
        return 1
    elif row=='H':
        return .5
    else:
        return 1

In [95]:
col_name_list = attendance_melted['name'].unique().tolist()

In [96]:
col_name_list

['Sally', 'Jane', 'Billy', 'John']

In [105]:
output = attendance_melted[(attendance_melted['name'] == col) & (attendance_melted['type'] == 'P')]['type'].count()
for col in col_name_list:
        print(f'Output: {output}')

Output: 5
Output: 5
Output: 5
Output: 5

In [101]:
attendance_melted['number'] = attendance_melted['type'].apply(condition)

In [102]:
attendance_melted.head()

    name         day type  number
0  Sally  2018-01-01    P     1.0
1   Jane  2018-01-01    A     1.0
2  Billy  2018-01-01    A     1.0
3   John  2018-01-01    P     1.0
4  Sally  2018-01-02    T     1.0

In [74]:
attendance_melted[attendance_melted['name']=='Billy']

     name         day type  number
2   Billy  2018-01-01    A     0.1
6   Billy  2018-01-02    T     0.1
10  Billy  2018-01-03    A     0.1
14  Billy  2018-01-04    A     0.1
18  Billy  2018-01-05    H     0.5
22  Billy  2018-01-06    T     0.1
26  Billy  2018-01-07    P     1.0
30  Billy  2018-01-08    T     0.1

In [103]:
attendance_melted.groupby(['name']).mean()

       number
name
Billy  0.9375
Jane   1.0000
John   0.9375
Sally  0.9375